trade_exp/src/Documents/ОрдерНаОтражениеИзлишковТоваров/ОрдерНаОтражениеИзлишковТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3aa37dd0-9f3a-43a2-8cb9-e23caed2a1f8">
  <name>ОрдерНаОтражениеИзлишковТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="86d43ea6-a1c0-43cc-8d76-e9666ec5d673">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a20f3d58-3b78-461a-aa6c-1408ff4bad57">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="db457f3d-83ff-4a5a-8117-ef5aac4b933e">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d97a63b8-7843-495d-a891-7491a1dee3d0">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="395bf2da-37a2-4d97-a339-034e29d39c34">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="984ac93e-7c79-459b-97af-c90af57d4421">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18711a34-336d-4cc9-9ffe-660485fd392f">
    <name>ПодтвержденСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f582bb4-f069-4136-b29e-8f8909c649bd">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c915cdda-46e9-468f-866c-9cf58b756b4c">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d85008e6-9f8b-42fc-93cd-19c6b5f38fa9">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6178af8b-3770-4726-a5e9-988319e0f8d9">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="52f20c4a-290a-4422-8974-a76fc07ff2f8">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4a3dd71-ade8-423d-8cae-9604b23cc60f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c2a21d0d-f57d-43f3-8075-6550275c7e38">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="78b246cf-3487-475b-90bc-f2dbc3fe83fb">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cd5cf2-becc-47fc-acc1-3f5e388de5cc">
    <name>ПокупкаПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="017e9b68-db4c-46f6-88bb-302b1d077101">
    <name>ДопоставкаНеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0192c7a0-d8f4-421f-84c3-0422e7c325bf">
    <name>ПерепоставленноеДарится</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47556336-3f8c-4d55-9a13-9637c157cae2">
    <name>ТребуетсяДопоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7be36844-c452-4b1b-b08c-6918502de0d0">
    <name>ОтгрузитьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f22e447b-d61a-47cc-88c8-6ee796c1e050">
    <name>НедостачаНеПризнана</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1b2d946d-c9f5-4037-8399-87421b020da2">
    <name>ВозвратПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f534a5d7-38e3-40b1-a5a3-1b2ebd98de08">
    <name>ОприходоватьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ОрдерНаОтражениеИзлишковТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда
		
		Основание =ДанныеЗаполнения.Ссылка;
		Склад = ДанныеЗаполнения.Склад;
		
		Для каждого Строка из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.КоличествоУпаковок = Строка.Количество;
		КонецЦикла;
		
		Ответственный = Пользователи.ТекущийПользователь();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда
		
		Основание =ДанныеЗаполнения.Ссылка;
		Склад = ДанныеЗаполнения.СкладОтправитель;
		
		Для каждого Строка из ДанныеЗаполнения.Товары Цикл
			//+Альтерра
			Если Строка.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка,,"Назначение");
				КоличУпаковок = Строка.КоличествоУпаковокПоДокументу - Строка.КоличествоУпаковок;
				МодульКоличУпаковок = Макс(КоличУпаковок, -КоличУпаковок);
				НоваяСтрока.КоличествоУпаковок = МодульКоличУпаковок;
				НоваяСтрока.Количество = МодульКоличУпаковок;
			КонецЕсли;	
			//-
		КонецЦикла;
		
		//-Альтерра
		//НоваяСтрока = Товары.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		//НоваяСтрока.КоличествоУпаковок = 0;
		//НоваяСтрока.Количество = 0;
		//-
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
		
		Основание =ДанныеЗаполнения.Ссылка;
		Склад = ДанныеЗаполнения.Склад;
		
		Для каждого Строка из ДанныеЗаполнения.Расхождения Цикл
			Если Строка.КоличествоУпаковок > 0 Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли
